tap "1password/tap"
tap "candid82/brew"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "robotsandpencils/made"
tap "timsutton/formulae"
tap "waydabber/betterdisplay"
tap "yqrashawn/goku"
tap "oven-sh/bun"

brew "mas"
brew "zsh"
brew "asdf"
brew "bat"
brew "chezmoi"
brew "elixir"
brew "exercism"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gitui"
brew "glib"
brew "go"
brew "harfbuzz"
brew "hashicorp/tap/terraform"
brew "helix"
brew "jesseduffield/lazygit/lazygit"
brew "jq"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "kubernetes-cli"
brew "leiningen"
brew "libass"
brew "libmagic"
brew "mysql"
brew "neofetch"
brew "neovim"
brew "openssl@3"
brew "osx-cross/avr/avr-gcc@9"
brew "pango"
brew "pipx"
brew "poetry"
brew "poppler"
brew "pure"
brew "qmk/qmk/qmk"
brew "readline"
brew "ripgrep"
brew "robotsandpencils/made/xcodes"
brew "tesseract"
brew "timsutton/formulae/speedwagon"
brew "tldr"
brew "tmux"
brew "tree"
brew "unar"
brew "watchman"
brew "waydabber/betterdisplay/betterdisplaycli"
brew "wget"
brew "xcbeautify"
brew "xcode-build-server"
brew "xz"
brew "yazi"
brew "yqrashawn/goku/goku"
brew "zig"
brew "zlib"
brew "zoxide"
brew "zplug"
brew "bun"
brew "rga"

cask "1password-cli"
cask "betterdisplay"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
cask "gcc-arm-embedded"
cask "google-cloud-sdk"
cask "mitmproxy"
cask "qmk-toolbox"
cask "sequel-ace"
cask "kando"
cask "hiddenbar"

vscode "alefragnani.project-manager"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmewburn.vscode-intelephense-client"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dhall.dhall-lang"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "jackz.unicode-conversion"
vscode "jock.svg"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "nwolverson.ide-purescript"
vscode "nwolverson.language-purescript"
vscode "pkief.material-icon-theme"
vscode "rebornix.ruby"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust"
vscode "teabyii.ayu"
vscode "tobiah.unity-tools"
vscode "unity.unity-debug"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wingrunr21.vscode-ruby"
vscode "xaver.clang-format"
vscode "zhuangtongfa.material-theme"
vscode "ziyasal.vscode-open-in-github"
