tap "1password/tap"
tap "candid82/brew"
tap "dart-lang/dart"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "robotsandpencils/made"
tap "timsutton/formulae"
tap "yqrashawn/goku"
brew "openssl@3"
brew "readline"
brew "asdf"
brew "xz"
brew "awscli"
brew "bat"
brew "chezmoi"
brew "elixir"
brew "eza"
brew "exercism"
brew "fd"
brew "fzf"
brew "gitui"
brew "go"
brew "leiningen"
brew "libmagic"
brew "neovim", args: ["HEAD"]
brew "poetry"
brew "pyenv"
brew "python@3.9"
brew "rbenv"
brew "ripgrep"
brew "tldr"
brew "tmux"
brew "tree"
brew "watchman"
brew "wget"
brew "zig"
brew "zlib"
brew "zsh"
brew "zoxide"
brew "dart-lang/dart/dart"
brew "hashicorp/tap/terraform"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "qmk/qmk/qmk"
brew "robotsandpencils/made/xcodes"
brew "timsutton/formulae/speedwagon"
brew "yqrashawn/goku/goku"
cask "1password-cli"
cask "betterdisplay"
cask "font-hack-nerd-font"
vscode "christian-kohler.path-intellisense"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dhall.dhall-lang"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "nwolverson.ide-purescript"
vscode "nwolverson.language-purescript"
vscode "rebornix.ruby"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust"
vscode "teabyii.ayu"
vscode "tobiah.unity-tools"
vscode "unity.unity-debug"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wingrunr21.vscode-ruby"
vscode "withfig.fig"
vscode "zhuangtongfa.material-theme"
